In [1]:
#ranges
#directionaries
#sets
#Operators
#Input and Output - part 1

In [2]:
range(0,10)

range(0, 10)

In [3]:
list(range(10))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [4]:
list(range(5,10))

[5, 6, 7, 8, 9]

In [5]:
list(range(0,10,3))

[0, 3, 6, 9]

In [8]:
list(range(10,1,-1))

[10, 9, 8, 7, 6, 5, 4, 3, 2]

In [9]:
#we cannot use float in range
range(1.1, 1.2)

TypeError: 'float' object cannot be interpreted as an integer

In [10]:
list(range(0,100,2))

[0,
 2,
 4,
 6,
 8,
 10,
 12,
 14,
 16,
 18,
 20,
 22,
 24,
 26,
 28,
 30,
 32,
 34,
 36,
 38,
 40,
 42,
 44,
 46,
 48,
 50,
 52,
 54,
 56,
 58,
 60,
 62,
 64,
 66,
 68,
 70,
 72,
 74,
 76,
 78,
 80,
 82,
 84,
 86,
 88,
 90,
 92,
 94,
 96,
 98]

In [11]:
#Dictionaries

In [12]:
mystudents_ages = {'Karan':30,'Rahul':32,'Amit':25}

In [13]:
mystudents_ages

{'Karan': 30, 'Rahul': 32, 'Amit': 25}

In [14]:
type(mystudents_ages)

dict

In [18]:
mystud = {'student_name': ['A','B','C','D','E'], 'student_age': [10,20,30,40,50] }

In [20]:
mystud

{'student_name': ['A', 'B', 'C', 'D', 'E'],
 'student_age': [10, 20, 30, 40, 50]}

In [21]:
type(mystud)

dict

In [23]:
mystud['region'] = ['s','s','w','w','e']

In [24]:
mystud

{'student_name': ['A', 'B', 'C', 'D', 'E'],
 'student_age': [10, 20, 30, 40, 50],
 'region': ['s', 's', 'w', 'w', 'e']}

In [25]:
mystud['subject'] = ['py','R','tab','PBI','PY']

In [26]:
mystud

{'student_name': ['A', 'B', 'C', 'D', 'E'],
 'student_age': [10, 20, 30, 40, 50],
 'region': ['s', 's', 'w', 'w', 'e'],
 'subject': ['py', 'R', 'tab', 'PBI', 'PY']}

In [27]:
#Data Frames
#Its tables in Python

In [41]:
import pandas as pd

In [42]:
mystud

{'student_name': ['A', 'B', 'C', 'D', 'E'],
 'student_age': [10, 20, 30, 40, 50],
 'region': ['s', 's', 'w', 'w', 'e'],
 'subject': ['py', 'R', 'tab', 'PBI', 'PY']}

In [44]:
pd.DataFrame(mystud)

  student_name  student_age region subject
0            A           10      s      py
1            B           20      s       R
2            C           30      w     tab
3            D           40      w     PBI
4            E           50      e      PY

In [53]:
mystud1 = mystud.copy()

In [54]:
mystud1

{'student_name': ['A', 'B', 'C', 'D', 'E'],
 'student_age': [10, 20, 30, 40, 50],
 'region': ['s', 's', 'w', 'w', 'e'],
 'subject': ['py', 'R', 'tab', 'PBI', 'PY']}

In [55]:
list(mystud1)

['student_name', 'student_age', 'region', 'subject']

In [56]:
type(mystud1)

dict

In [57]:
mystud1

{'student_name': ['A', 'B', 'C', 'D', 'E'],
 'student_age': [10, 20, 30, 40, 50],
 'region': ['s', 's', 'w', 'w', 'e'],
 'subject': ['py', 'R', 'tab', 'PBI', 'PY']}

In [58]:
pd.DataFrame(mystud1)

  student_name  student_age region subject
0            A           10      s      py
1            B           20      s       R
2            C           30      w     tab
3            D           40      w     PBI
4            E           50      e      PY

In [59]:
#Assign values to ly dic
mystud1 = mystud1.fromkeys({'student_name'},"NA")

In [61]:
mystud1

{'student_name': 'NA'}

In [62]:
# delete dic
del mystud1

In [63]:
mystud1

NameError: name 'mystud1' is not defined

In [64]:
mystud

{'student_name': ['A', 'B', 'C', 'D', 'E'],
 'student_age': [10, 20, 30, 40, 50],
 'region': ['s', 's', 'w', 'w', 'e'],
 'subject': ['py', 'R', 'tab', 'PBI', 'PY']}

In [65]:
#get command to get the single value
mystud.get('student_name')

['A', 'B', 'C', 'D', 'E']

In [66]:
mystud['student_name']

['A', 'B', 'C', 'D', 'E']

In [69]:
mystud['student_name'][0:2]
mystud['student_name'][3]

'D'

In [70]:
#View the list of the dic
mystud.items()

dict_items([('student_name', ['A', 'B', 'C', 'D', 'E']), ('student_age', [10, 20, 30, 40, 50]), ('region', ['s', 's', 'w', 'w', 'e']), ('subject', ['py', 'R', 'tab', 'PBI', 'PY'])])

In [71]:
#get the header name
mystud.keys()

dict_keys(['student_name', 'student_age', 'region', 'subject'])

In [72]:
#POP to remove the header values from the dic
mystud.pop('subject')

['py', 'R', 'tab', 'PBI', 'PY']

In [73]:
mystud

{'student_name': ['A', 'B', 'C', 'D', 'E'],
 'student_age': [10, 20, 30, 40, 50],
 'region': ['s', 's', 'w', 'w', 'e']}

In [74]:
mystud['subject'] = ['py','R','tab','PBI','PY']

In [75]:
mystud

{'student_name': ['A', 'B', 'C', 'D', 'E'],
 'student_age': [10, 20, 30, 40, 50],
 'region': ['s', 's', 'w', 'w', 'e'],
 'subject': ['py', 'R', 'tab', 'PBI', 'PY']}

In [77]:
pd.DataFrame(mystud)

  student_name  student_age region subject
0            A           10      s      py
1            B           20      s       R
2            C           30      w     tab
3            D           40      w     PBI
4            E           50      e      PY

In [79]:
#Delete the index values
del mystud['region'][2]

In [81]:
mystud

{'student_name': ['A', 'B', 'C', 'D', 'E'],
 'student_age': [10, 20, 30, 40, 50],
 'region': ['s', 's', 'w', 'e'],
 'subject': ['py', 'R', 'tab', 'PBI', 'PY']}

In [89]:
mystud['region'][2] = 'w'

In [87]:
mystud

{'student_name': ['A', 'B', 'C', 'D', 'E'],
 'student_age': [10, 20, 30, 40, 50],
 'region': ['s', 's', ['w'], 'e'],
 'subject': ['py', 'R', 'tab', 'PBI', 'PY']}

In [88]:
mystud

{'student_name': ['A', 'B', 'C', 'D', 'E'],
 'student_age': [10, 20, 30, 40, 50],
 'region': ['s', 's', ['w'], 'e'],
 'subject': ['py', 'R', 'tab', 'PBI', 'PY']}

In [90]:
mystud['region']= ['s', 's', 'ew','e', 'e']

In [91]:
mystud

{'student_name': ['A', 'B', 'C', 'D', 'E'],
 'student_age': [10, 20, 30, 40, 50],
 'region': ['s', 's', 'ew', 'e', 'e'],
 'subject': ['py', 'R', 'tab', 'PBI', 'PY']}

In [92]:
pd.DataFrame(mystud)

  student_name  student_age region subject
0            A           10      s      py
1            B           20      s       R
2            C           30     ew     tab
3            D           40      e     PBI
4            E           50      e      PY

In [93]:
#Pop items to remove the column name. if you dont pass the any argument it will delete value from last cell

In [94]:
mystud.popitem()

('subject', ['py', 'R', 'tab', 'PBI', 'PY'])

In [95]:
mystud

{'student_name': ['A', 'B', 'C', 'D', 'E'],
 'student_age': [10, 20, 30, 40, 50],
 'region': ['s', 's', 'ew', 'e', 'e']}

In [96]:
mystud['subject'] = ['py','R','tab','PBI','PY']

In [97]:
mystud

{'student_name': ['A', 'B', 'C', 'D', 'E'],
 'student_age': [10, 20, 30, 40, 50],
 'region': ['s', 's', 'ew', 'e', 'e'],
 'subject': ['py', 'R', 'tab', 'PBI', 'PY']}

In [98]:
#Setdefault add new key  but you can do the same using below command 
#mystud['subject'] = ['py','R','tab','PBI','PY']

In [99]:
dict1 = {1,2}
dict2 = {3,4}
dict1.update(dict2)
dict1

{1, 2, 3, 4}

In [100]:
dict1 = {1,2}
dict2 = {2,4}
dict1.update(dict2)
dict1

{1, 2, 4}

In [104]:
mystud.update(dict1)

TypeError: cannot convert dictionary update sequence element #0 to a sequence

In [106]:
mystud.values()

dict_values([['A', 'B', 'C', 'D', 'E'], [10, 20, 30, 40, 50], ['s', 's', 'ew', 'e', 'e'], ['py', 'R', 'tab', 'PBI', 'PY']])

In [107]:
mystud

{'student_name': ['A', 'B', 'C', 'D', 'E'],
 'student_age': [10, 20, 30, 40, 50],
 'region': ['s', 's', 'ew', 'e', 'e'],
 'subject': ['py', 'R', 'tab', 'PBI', 'PY']}

In [108]:
mystud['new_student_name'] = mystud['student_name']

In [109]:
mystud

{'student_name': ['A', 'B', 'C', 'D', 'E'],
 'student_age': [10, 20, 30, 40, 50],
 'region': ['s', 's', 'ew', 'e', 'e'],
 'subject': ['py', 'R', 'tab', 'PBI', 'PY'],
 'new_student_name': ['A', 'B', 'C', 'D', 'E']}

In [110]:
pd.DataFrame(mystud)

  student_name  student_age region subject new_student_name
0            A           10      s      py                A
1            B           20      s       R                B
2            C           30     ew     tab                C
3            D           40      e     PBI                D
4            E           50      e      PY                E

In [112]:
#Sets how to create
# set will show only unique values
myset1 = {1,2,1,2,1,3,34,5,6,1,9}
myset1

{1, 2, 3, 5, 6, 9, 34}

In [113]:
myset1 = set((1,2,1,2,1,3,34,5,6,1,9))
myset1

{1, 2, 3, 5, 6, 9, 34}

In [114]:
myset1.add(99)
myset1

{1, 2, 3, 5, 6, 9, 34, 99}

In [116]:
myset1.discard(99)
myset1

{1, 2, 3, 5, 6, 9, 34}

In [117]:
myset1

{1, 2, 3, 5, 6, 9, 34}

In [118]:
myset1.remove(9)

In [119]:
myset1

{1, 2, 3, 5, 6, 34}

In [120]:
#here Pop will remove the 1st value
myset1.pop()

1

In [121]:
myset1

{2, 3, 5, 6, 34}

In [122]:
#Update the values
myset1.update((10,20))

In [123]:
myset1

{2, 3, 5, 6, 10, 20, 34}

In [124]:
myset1.update([30,20])

In [125]:
myset1

{2, 3, 5, 6, 10, 20, 30, 34}

In [128]:
#Difference to show difference b/t two sets
myset2 = {99,102}
print(myset1)
print(myset2)
myset1.difference(myset2)

{2, 3, 34, 5, 6, 10, 20, 30}
{99, 102}

{2, 3, 5, 6, 10, 20, 30, 34}

In [129]:
myset2.difference(myset1)

{99, 102}

In [130]:
myset1.difference_update(myset2)

In [131]:
myset1

{2, 3, 5, 6, 10, 20, 30, 34}

In [132]:
myset2.difference_update(myset1)
myset2

{99, 102}

In [133]:
myset1.intersection(myset2)

set()

In [135]:
myset2.add(2)

In [136]:
print(myset1)
print(myset2)

{2, 3, 34, 5, 6, 10, 20, 30}
{2, 99, 102}

In [137]:
myset1.intersection(myset2)

{2}

In [138]:
myset2.intersection(myset1)

{2}

In [139]:
myset1.intersection_update(myset2)

In [140]:
print(myset1)
print(myset2)

{2}
{2, 99, 102}

In [141]:
myset2.intersection_update(myset1)

In [143]:
print(myset1)
print(myset2)

{2}
{2}

In [144]:
#Operators in python
 #Airthmaric
 # Relational Operations or comparision operators
 #logical operators 
 # Equality 
# bitwise
#assignment 
#special

In [3]:
 #Airthmaric
    
    # + - * / 
    #% moduler
    #// Floor division
    #** Power
    

a = 20
b = 10

print('a+b:', a+b)
print('a-b:', a-b)
print('a/b:', a/b)
print('a*b:', a*b)
print('a//b:', a//b)
print('a**b:', a**b)


#Relational Operators

#>
#<
#>=
#<=

a = 10
b = 20

print('a>b:', a>b)
print('a<b:', a<b)
print('a>=b:', a>=b)
print('a<=b:', a<=b)

a+b: 30
a-b: 10
a/b: 2.0
a*b: 200
a//b: 2
a**b: 10240000000000
a>b: False
a<b: True
a>=b: False
a<=b: True

In [7]:
#Equality operators
#== equal to
#!= not equal to

list1 = [1,2,3]
list2 = [1,3,3]

print(list1==list2)
print(list1!=list2)

False
True

In [17]:
#Logical operators
#and
#or
#not



print(True and True)
print(True and False)
print(not True)
print(not False)



a = 10
b = 20

a and b
# Apart from zero everything is true

c = ''
d =1
c and d

True
False
False
True

''

In [19]:
#Ternary Operator
x = 30 if 10 > 20 else 40 
print(x)

40

In [31]:
a = int(input("Enter the 1st number"))
b = int(input("Enter the 2nd number"))
c = int(input("Enter the 3rd number"))

print(a,b,c)
x = a if a>b>c else b if b>c>a else c 
print(x)

Enter the 1st number30
Enter the 2nd number20
Enter the 3rd number10
30 20 10
30

In [33]:
a = int(input("Enter the 1st number"))
b = int(input("Enter the 2nd number"))
c = int(input("Enter the 3rd number"))

print(a,b,c)
x = a if a>b>c else b if b>c>a else c 
print(x)

Enter the 1st number1
Enter the 2nd number5
Enter the 3rd number2
1 5 2
5

In [39]:
#Special operators
#1. Identity operator , IO (IS or IS not)
#2. Membership operator  MO (in or not in)

a = 10
b = 10
print(a is b)
print(a is not b)

list3 = [1,2,3]
list4 = [1,2,3]
print(list3,list4)
print(list3 is list4) # this is false due to memory location

print(id(list3))
print(id(list4))

True
False
[1, 2, 3] [1, 2, 3]
False
2216920731784
2216920731720

In [42]:
print(list1)
1 in list1

10 not in list1

[1, 2, 3]

True

In [45]:
a = int(input('enter the 1st number'))
b = int(input('enter the 2nd number'))
c = a+b
print('Sum is', c)

enter the 1st number2
enter the 2nd number3
Sum is 5

In [47]:
#Compound Assignment Operator

a = 10
a +=100
print(a)

110

In [50]:
#-=
#*=
#/=
#%=
#//=
#**=
a=100
a -=10
print(a)

90